export default function ModalContent() {
  return (
    <div className="space-y-4 text-sm text-gray-600">
      <h3 className="font-medium text-primery-600 mb-4">توضیحات چالش</h3>
      <p>چالش حذف شکر | آگاهی به سوی سلامتی و زندگی بهتر</p>
      <p>آیا تا به حال به این فکر کرده‌اید که چقدر شکر در رژیم غذایی شما وجود دارد؟</p>
      <p>شکر افزوده تقریباً در همه‌جا حضور دارد، از نوشیدنی‌های گازدار و شیرینی‌ها تا سس‌ها و نان‌های صنعتی و حتی برخی خوراکی‌های به‌ظاهر سالم! با اینکه مصرف متعادل قند طبیعی (مانند میوه‌ها) برای بدن ضروری است، اما شکر فرآوری‌شده و افزوده شده می‌تواند اثرات مخربی بر سلامت داشته باشد.</p>
      <p>این چالش با هدف کاهش و در نهایت حذف شکر افزوده از رژیم غذایی طراحی شده است تا به شما کمک کند:</p>
      <div className="space-y-2">
        <p>سطح انرژی پایدارتر و احساس شادابی بیشتری داشته باشید</p>
        <p>وزن و تناسب اندام را تجربه کنید</p>
        <p>کیفیت خواب خود را بهبود ببخشید</p>
        <p>از نوسانات خلقی و افت انرژی ناشی از مصرف شکر جلوگیری کنید</p>
        <p>خطر ابتلا به بیماری‌هایی مانند دیابت، مشکلات قلبی و التهابات مزمن را کاهش دهید</p>
      </div>
      <div className="font-medium">قوانین چالش:</div>
      <ol className="list-decimal list-inside space-y-2 pr-4">
        <li>حذف کامل شکر افزوده‌شده و خوراکی‌هایی که شکر فرآوری‌شده دارند مانند شیرینی‌ها، نوشابه‌ها، شربت‌ها، آبمیوه‌های صنعتی، دسرها، کیک و شکلات باید کنار گذاشته شوند.</li>
        <li>برچسب‌خوانی دقیق: قبل از خرید مواد غذایی، برچسب ترکیبات را بررسی کنید و از محصولاتی که حاوی شکر افزوده (گلوکز، فروکتوز، ساکارز و ...) هستند، پرهیز کنید.</li>
        <li>جایگزین‌های سالم: به جای شیرینی‌های ناسالم، میوه‌های تازه، آجیل، دمنوش‌های طبیعی و اسموتی‌های خانگی مصرف کنید.</li>
        <li>آب: زیاد بنوشید. نوشیدن آب به کاهش میل به شیرینی و سرد‌سازی بدن کمک می‌کند.</li>
        <li>حذف نوشیدنی‌های شیرین: قهوه یا چای خود را بدون قند بنوشید و نوشیدنی‌های شیرین را حذف کنید.</li>
        <li>صبور باشید و به بدن خود فرصت دهید. ممکن است در روزهای اول هوس شیرینی داشته باشید، اما پس از چند روز به شیوه شکر عادت خواهید کرد و احساس بهتری خواهید داشت.</li>
      </ol>
      <div>چطور شروع کنید؟</div>
      <p>مدت زمان چالش می‌تواند متفاوت باشد، اما یک دوره ۲۱ تا ۳۰ روزه برای کسب نتایج مطلوب توصیه می‌شود. برخی افراد تصمیم می‌گیرند برای همیشه مصرف شکر افزوده را کاهش دهند!</p>
      <div>آیا آماده‌اید که این چالش را شروع کنید؟</div>
      <p>اگر به دنبال یک تغییر مثبت در زندگی خود هستید، همین امروز تصمیم بگیرید و چالش حذف شکر را آغاز کنید. تجربه‌ها، احساسات و دستاوردهای خود را در طول مسیر یادداشت کنید و اگر دوست داشتید، دیگران را هم به این چالش دعوت کنید تا همراهتان باشند!</p>
    </div>
  );
} 